# StairstypeHasLeftSupport Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeHasLeftSupport Property
ParameterTypeId Class See Also
---
"Left Support":
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeHasLeftSupport { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeHasLeftSupport As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeHasLeftSupport {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace